{
    "welcome": "Welcome to the site",
    "introduction": "introduccion...",
    "vision": "Vision",
    "vision-extra-text": "DevRoads doesn’t aim to replace any existing digital tools or platforms. Instead, it seeks to become a central learning hub for everyone—regardless of background or experience level. It’s a place where the true power and simplicity of being a programmer are showcased. DevRoads is here to inspire, guide, and connect future developers by making the path to learning clear, approachable, and empowering.",
    "goal": "Goal",
    "goal-text": "Create an accessible digital space where anyone interested in programming can learn, find direction, and collaborate. This site aims to inspire new developers by showcasing the real-world impact of coding—without idealizing or complicating the path. All you need is a computer, a clear vision, and the right guidance.",
    "tool": "Tool",
    "tool-text": "This platform serves as a practical reference guide for those learning to code. It offers visual learning paths tailored to specific goals (e.g., launching an app on iOS or building a game with AI). It provides curated content, tools, and guidance—without overwhelming users with unnecessary information. This focused approach is core to DevRoads.",
    "function": "Function",
    "function-text": "Help beginners learn programming in a structured way, understanding how different knowledge areas connect to their real goals. It also serves as a meeting point for developers of all levels to collaborate on projects and find opportunities where they can make an impact. DevRoads will cover everything from launching MVP apps across platforms to building AI models.",
    "development": "Development",
    "development-text": "This is just a quick overview of how DevRoads is expected to grow and take shape over time. It outlines the initial direction and structure we envision, serving as a foundation for what will gradually become a more complete and collaborative platform.",
    "development-contribute-title": "So, how can you help DevRoads to reach its goal?",
    "development-contribute": "Want to be part of the journey? DevRoads is being built with community at its heart. Whether you’re a developer, designer, educator, or enthusiast—there’s a way to contribute. ",
    "Me": "ABoutme",
    "Me-text": "me-textarea",
    "stages": "Stages",
    "stage1-title": "Stage 1 – Overview of computing",
    "stage1.1": "1.1.1 Evolution timeline",
    "stage1.2": "1.1.2 Key figures",
    "stage1.3": "1.1.3 Current context",
    "stage1.4": "1.2.1 The developers craft",
    "stage1.5": "1.2.2 Computing on human impact",
    "stage2-title": "Stage 2 – Actual Tools and Languages",
    "stage3-title": "Stage 3 – Roadmaps and Learning System",
    "stage4-title": "Stage 4 – ...",
    "stage5-title": "Stage 5 – ..."
}