{
    "welcome": "Bienvenido a DevRoads",
    "introduction": "DevRoads es una plataforma en desarrollo pensada para todas las personas que quieren aprender programación. Aún no está completa, pero su objetivo es convertirse en un punto de partida claro y accesible para quienes desean comenzar a crear proyectos reales. La idea es mostrar el verdadero poder de programar de forma sencilla, honesta y útil: desde cómo ha influido históricamente en la humanidad hasta cómo hoy está transformando industrias, ideas y formas de vivir. Cuando esté en funcionamiento, DevRoads buscará conectar el aprendizaje con metas concretas—como lanzar una app, desarrollar un juego o construir modelos de inteligencia artificial—mediante una guía visual y enfocada que acompañe paso a paso.",
    "vision": "Visión",
    "vision-extra-text": "DevRoads no busca reemplazar ninguna herramienta digital o plataforma existente. Su propósito es convertirse en un centro de aprendizaje accesible para todos, sin importar su experiencia o formación. Será un espacio donde se demuestre lo poderoso y sencillo que puede ser ser programador. DevRoads aspira a inspirar, guiar y conectar a futuras generaciones de desarrolladores, mostrando que el camino para aprender a programar puede ser claro, cercano y transformador.",
    "goal": "Meta",
    "goal-text": "Crear un espacio digital accesible donde cualquier persona interesada en la programación pueda aprender, encontrar dirección y colaborar. Aunque aún está en construcción, el objetivo de este sitio es inspirar a nuevos desarrolladores mostrando el verdadero impacto del código en el mundo real, sin idealizar ni complicar el camino. Solo necesitas una computadora, una visión clara y la guía adecuada.",
    "tool": "Herramienta",
    "tool-text": "DevRoads se está construyendo como una guía práctica de referencia para quienes están aprendiendo a programar. Planea ofrecer rutas de aprendizaje visuales adaptadas a objetivos concretos (por ejemplo: lanzar una app en iOS o crear un juego con inteligencia artificial). Incluirá contenido curado, herramientas útiles y orientación sin saturar al usuario con información innecesaria. Este enfoque claro será uno de los pilares de DevRoads.",
    "function": "Función",
    "function-text": "DevRoads tiene como objetivo ayudar a las personas principiantes a aprender programación de forma estructurada, entendiendo cómo se conectan las distintas áreas del conocimiento con sus metas reales. También busca funcionar como punto de encuentro para que desarrolladores de todos los niveles colaboren en proyectos y encuentren oportunidades donde puedan generar impacto. Se espera que DevRoads abarque todo, desde lanzar aplicaciones MVP en múltiples plataformas hasta crear modelos de inteligencia artificial.",
    "development": "Desarrollo",
    "development-text": "Este es solo el enfoque inicial de cómo DevRoads debe avanzar. Representa la dirección que buscamos seguir para construir una plataforma colaborativa y útil.",
    "development-contribute-title": "¿Cómo puedes ayudar a DevRoads a alcanzar su objetivo?",
    "development-contribute": "¿Quieres ser parte del recorrido? DevRoads se está construyendo con la comunidad en el centro. Ya seas desarrollador, diseñador, educador o entusiasta, hay una manera de contribuir.",
    "Me": "Sobre mí",
    "Me-text": "Área de texto sobre mí."
}